Revit 2027 API
MultiReferenceAnnotationType.TagTypeId Property
 The tag type which will be used by the child tag the multi-reference annotation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId TagTypeId { get; set; }
Public Property TagTypeId As ElementId
	Get
	Set
public:
property ElementId^ TagTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member TagTypeId : ElementId with get, set
Property Value
ElementId
 The tag type must be able to tag elements belonging to the multi-reference annotation's reference category.
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The tag type is not allowed.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
MultiReferenceAnnotationType Class
Autodesk.Revit.DB Namespace